#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
null_resource.dependencies_layer: Refreshing state... [id=830245200781157250]
data.archive_file.lambda_zip: Reading...
random_string.random: Refreshing state... [id=sZHL]
data.archive_file.lambda_zip: Read complete after 0s [id=dfbb58116cc18ec285bf84abe4b511917b9ea314]
aws_iam_policy.lambda_exec_role: Refreshing state... [id=arn:aws:iam::127449185323:policy/lambda-tf-pattern-ddb-post]
aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/pastebin-sZHL]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/pastebin-sZHL]
aws_iam_role.lambda_exec: Refreshing state... [id=LambdaDdbPost]
aws_apigatewayv2_api.http_lambda: Refreshing state... [id=exj5m66tib]
aws_sns_topic.budget_notification: Refreshing state... [id=arn:aws:sns:ca-central-1:127449185323:BudgetNotificationTopic]
aws_dynamodb_table.paste: Refreshing state... [id=paste]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=pastebin20231223003519593600000001]
aws_sns_topic_subscription.email_subscription: Refreshing state... [id=arn:aws:sns:ca-central-1:127449185323:BudgetNotificationTopic:6fac9d94-197f-4a31-b6ee-8c9702c91d24]
aws_cloudwatch_metric_alarm.budget_alarm: Refreshing state... [id=MonthlyChargeAlarm]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=LambdaDdbPost-20231223010623714500000001]
aws_s3_bucket_ownership_controls.lambda_bucket: Refreshing state... [id=pastebin20231223003519593600000001]
aws_s3_object.this: Refreshing state... [id=src.zip]
aws_s3_bucket_acl.private_bucket: Refreshing state... [id=pastebin20231223003519593600000001,private]
aws_lambda_function.apigw_lambda_ddb: Refreshing state... [id=pastebin-sZHL]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_integration.apigw_lambda: Refreshing state... [id=v3fnxm6]
aws_apigatewayv2_route.options: Refreshing state... [id=wyq0020]
aws_apigatewayv2_route.post: Refreshing state... [id=3h7xv4f]
aws_apigatewayv2_route.get: Refreshing state... [id=jyrrkzs]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.apigw_lambda_ddb will be updated in-place
  ~ resource "aws_lambda_function" "apigw_lambda_ddb" {
        id                             = "pastebin-sZHL"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:6",
        ] -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.dependencies_layer will be created
  + resource "aws_lambda_layer_version" "dependencies_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.9",
        ]
      + created_date                = (known after apply)
      + filename                    = "layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "python-layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "OuCKquuiuDnoGU0xln/UUcczDSwvC6eklk0rQQKq+AI="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @socraticDevBlog, Action: `pull_request`*